/////// EUROCODE Steel Moment Bolt Connection
IDC_GESMC_CHKDATA_SECT_GIRDER_NO1             = "Invalid Girder No : Girder No < 1"
IDC_GESMC_CHKDATA_SECT_GIRDER_NO2             = "Invalid Girder No : Girder No > 2"
IDC_GESMC_CHKDATA_SECT_COLUMN_NO1             = "Invalid Column No : Column No < 1"
IDC_GESMC_CHKDATA_SECT_COLUMN_NO2             = "Invalid Column No : Column No > 2"

IDC_GESMC_CHKDATA_SECT_ANGLE0                 = "Invalid Angle : Angle < 0.0"
IDC_GESMC_CHKDATA_SECT_ANGLE360               = "Invalid Angle : Angle > 360.0"
IDC_GESMC_CHKDATA_SECT_ANGLE_MINUS90          = "Invalid Angle : Angle < -90.0"
IDC_GESMC_CHKDATA_SECT_ANGLE_PLUS90           = "Invalid Angle : Angle > 90.0"
IDC_GESMC_CHKDATA_SECT_WELD_WEB_MIN           = "Invalid Throat Thickness : Web Thick < 0.0"
IDC_GESMC_CHKDATA_SECT_WELD_WEB_MAX           = "Invalid Throat Thickness : Web Thick > MAX."
IDC_GESMC_CHKDATA_SECT_WELD_FLG_MIN           = "Invalid Throat Thickness : Flange Thick < 0.0"
IDC_GESMC_CHKDATA_SECT_WELD_FLG_MAX           = "Invalid Throat Thickness : Flange Thick > MAX."
IDC_GESMC_CHKDATA_SECT_THROAT_THICK           = "\nThroat Thickness = (Leg length) / √2"

IDC_GESMC_CHKDATA_BRACKET_TYPE                = "Invalid Bracket Type : Choose H Section or Plate."
IDC_GESMC_CHKDATA_BRACKET_PLATE_THK_MIN       = "Invalid Bracket Plate Thickness : Thickness < 0.0"
IDC_GESMC_CHKDATA_BRACKET_PLATE_THK_MAX       = "Invalid Bracket Plate Thickness : Thickness > MAX."
IDC_GESMC_CHKDATA_BRACKET_LENGTH_MIN          = "Invalid Bracket Length : Length < 0.0"
IDC_GESMC_CHKDATA_BRACKET_LENGTH_MAX          = "Invalid Bracket Length : Length > MAX."
IDC_GESMC_CHKDATA_BRACKET_HEIGHT1_MIN         = "Invalid Bracket Height : Height1 < 0.0"
IDC_GESMC_CHKDATA_BRACKET_HEIGHT1_MAX         = "Invalid Bracket Height : Height1 > MAX."
IDC_GESMC_CHKDATA_BRACKET_HEIGHT2_MIN         = "Invalid Bracket Height : Height2 < 0.0"
IDC_GESMC_CHKDATA_BRACKET_HEIGHT2_MAX         = "Invalid Bracket Height : Height2 > MAX."
IDC_GESMC_CHKDATA_SECT_CLASS_NO               = "Invalid Section Class : Select 1, 2, 3, 4"
IDC_GESMC_CHKDATA_SECT_MODULUS0               = "Invalid Section Modulus : Section Modulus < 0"

IDC_GESMC_CHKDATA_END_PLATE_THK_MIN           = "Invalid End Plate Thickness : Thickness < 0.0"
IDC_GESMC_CHKDATA_END_PLATE_THK_MAX           = "Invalid End Plate Thickness : Thickness > MAX."
IDC_GESMC_CHKDATA_END_PLATE_WID_MIN           = "Invalid End Plate Width : Width < 0.0"
IDC_GESMC_CHKDATA_END_PLATE_WID_MAX           = "Invalid End Plate Width : Width > MAX."
IDC_GESMC_CHKDATA_END_PLATE_EXTOP_MIN         = "Invalid End Plate Extension : Top < 0.0"
IDC_GESMC_CHKDATA_END_PLATE_EXTOP_MAX         = "Invalid End Plate Extension : Top > MAX."
IDC_GESMC_CHKDATA_END_PLATE_EXBOT_MIN         = "Invalid End Plate Extension : Bottom < 0.0"
IDC_GESMC_CHKDATA_END_PLATE_EXBOT_MAX         = "Invalid End Plate Extension : Bottom > MAX."

IDC_GESMC_CHKDATA_WEB_STIF_TYPE               = "Invalid Column Web Stiffener Type"
IDC_GESMC_CHKDATA_WEB_STIF_SIDE_NO1           = "Invalid Column Web Stiffener Side No : No < 1"
IDC_GESMC_CHKDATA_WEB_STIF_SIDE_NO2           = "Invalid Column Web Stiffener Side No : No > 2"
IDC_GESMC_CHKDATA_WEB_STIF_THK_MIN            = "Invalid Column Web Stiffener : Thickness < 0.0"
IDC_GESMC_CHKDATA_WEB_STIF_THK_MAX            = "Invalid Column Web Stiffener : Thickness > MAX."
IDC_GESMC_CHKDATA_WEB_STIF_WIDTH_MIN          = "Invalid Column Web Stiffener : Width < 0.0"
IDC_GESMC_CHKDATA_WEB_STIF_WIDTH_MAX          = "Invalid Column Web Stiffener : Width > MAX."
IDC_GESMC_CHKDATA_WEB_STIF_HEIGHT_MIN         = "Invalid Column Web Stiffener : Height < 0.0"
IDC_GESMC_CHKDATA_WEB_STIF_HEIGHT_MAX         = "Invalid Column Web Stiffener : Height > MAX."

IDC_GESMC_CHKDATA_FLG_STIF_THK_MIN            = "Invalid Stiffener : Thickness < 0.0"
IDC_GESMC_CHKDATA_FLG_STIF_THK_MAX            = "Invalid Stiffener : Thickness > MAX."
IDC_GESMC_CHKDATA_FLG_STIF_WIDTH_MIN          = "Invalid Stiffener : Width < 0.0"
IDC_GESMC_CHKDATA_FLG_STIF_WIDTH_MAX          = "Invalid Stiffener : Width > MAX."
IDC_GESMC_CHKDATA_FLG_STIF_CORNER_MIN         = "Invalid Stiffener : Corner Radius < 0.0"
IDC_GESMC_CHKDATA_FLG_STIF_CORNER_MAX         = "Invalid Stiffener : Corner Radius > MAX."

IDC_GESMC_CHKDATA_SHEAR_ROW_DESIGNATION       = "Invalid Shear Row Designation : Choose Auto or User."
IDC_GESMC_CHKDATA_BOLT_TYPE                   = "Invalid Bolt Type : Choose Ordinary or Countersunk."
IDC_GESMC_CHKDATA_BOLT_LAYOUT_TYPE            = "Invalid Bolt Layout Type : Choose Auto or User."
IDC_GESMC_CHKDATA_BOLT_SLIP_FACT_MIN          = "Invalid Bolt Slip Factor : Factor < 0.0"
IDC_GESMC_CHKDATA_BOLT_SLIP_FACT_MAX          = "Invalid Bolt Slip Factor : Factor > 1.0"
IDC_GESMC_CHKDATA_BOLT_ROW_IN_TOP_EXTENSION   = "Invalid Bolt Layout : Rows in Top Extension > 1"

IDC_GESMC_CHKDATA_BOLT_AUTO_COLUMN            = "Invalid Layout Column : Column is not 2."
IDC_GESMC_CHKDATA_BOLT_AUTO_ROW_TOP           = "Invalid Layout Row : Top Row < 1"
IDC_GESMC_CHKDATA_BOLT_AUTO_ROW_BOT           = "Invalid Layout Row : Bottom Row < 1"
IDC_GESMC_CHKDATA_BOLT_AUTO_EXTHOR_MIN        = "Invalid Layout Extension : Horizontal < 0.0"
IDC_GESMC_CHKDATA_BOLT_AUTO_EXTHOR_MAX        = "Invalid Layout Extension : Horizontal > MAX."
IDC_GESMC_CHKDATA_BOLT_AUTO_EXTVER_MIN        = "Invalid Layout Extension : Vertical < 0.0"
IDC_GESMC_CHKDATA_BOLT_AUTO_EXTVER_MAX        = "Invalid Layout Extension : Vertical > MAX."
IDC_GESMC_CHKDATA_BOLT_AUTO_EXTTOP_MIN        = "Invalid Layout Extension : Vertical ( Top ) < 0.0"
IDC_GESMC_CHKDATA_BOLT_AUTO_EXTTOP_MAX        = "Invalid Layout Extension : Vertical ( Top ) > MAX."
IDC_GESMC_CHKDATA_BOLT_AUTO_EXTBOT_MIN        = "Invalid Layout Extension : Vertical ( Bottom ) < 0.0"
IDC_GESMC_CHKDATA_BOLT_AUTO_EXTBOT_MAX        = "Invalid Layout Extension : Vertical ( Bottom ) > MAX."
IDC_GESMC_CHKDATA_BOLT_AUTO_SPACEV_MIN        = "Invalid Layout Spacing : Vertical < 0.0"
IDC_GESMC_CHKDATA_BOLT_AUTO_SPACEV_MAX        = "Invalid Layout Spacing : Vertical > MAX."
IDC_GESMC_CHKDATA_BOLT_AUTO_SPACEH_MIN        = "Invalid Layout Spacing : Horizontal < 0.0"
IDC_GESMC_CHKDATA_BOLT_AUTO_SPACEH_MAX        = "Invalid Layout Spacing : Horizontal > MAX."
IDC_GESMC_CHKDATA_BOLT_AUTO_OFFSET_MIN        = "Invalid Layout Offset : Offset < 0.0"
IDC_GESMC_CHKDATA_BOLT_AUTO_OFFSET_MAX        = "Invalid Layout Offset : Offset > MAX."

IDC_GESMC_CHKDATA_BOLT_USER_COLUMN            = "Invalid Layout Column : Column is not 2."
IDC_GESMC_CHKDATA_BOLT_USER_SPACEH_MIN        = "Invalid Layout Spacing : Horizontal < 0.0"
IDC_GESMC_CHKDATA_BOLT_USER_SPACEH_MAX        = "Invalid Layout Spacing : Horizontal > MAX."
IDC_GESMC_CHKDATA_BOLT_USER_TOP_NONE          = "Invalid Layout : Top Position is not Exist."
IDC_GESMC_CHKDATA_BOLT_USER_TOP_ZERO          = "Invalid Layout : Zero Position is Exist in Top."
IDC_GESMC_CHKDATA_BOLT_USER_BOT_NONE          = "Invalid Layout : Bottom Position is not Exist."
IDC_GESMC_CHKDATA_BOLT_USER_BOT_ZERO          = "Invalid Layout : Zero Position is Exist in Bottom."

IDC_GESMC_CHKDATA_FORC_EMPTY                  = "Invalid Load Combination : LCB is Empty."
IDC_GESMC_CHKDATA_FORC_UNEQUAL                = "Invalid Load Combination : Number of LCB is not Equal."
IDC_GESMC_CHKDATA_FORC_NOT_SELECT             = "Invalid Load Combination : LCB is not Selected."

IDC_GESMC_CHKDATA_FACT_MIN                    = "Invalid Reduction Factor : Factor < 0.0"
IDC_GESMC_CHKDATA_FACT_MAX                    = "Invalid Reduction Factor : Factor > MAX."

IDC_GESMC_CHKDATA_DISP_TYPE                   = "Invalid Preview Type"

IDS_EC_TB_NAME_CHECK_ITEMS                    = "Check Items"
IDS_EC_TB_NAME_VALUE                          = "Value"
IDS_EC_TB_NAME_CRITERIA                       = "Criteria"
IDS_EC_TB_NAME_REMARK                         = "Remark"
IDS_EC_TB_NAME_GIRDER_FLG                     = "Girder Flange"
IDS_EC_TB_NAME_GIRDER_WEB                     = "Girder Web"
IDS_EC_TB_NAME_HAUNCH_FLG                     = "Haunch Flange"
IDS_EC_TB_NAME_HAUNCH_WEB                     = "Haunch Web"
IDS_EC_TB_NAME_RESISTANCE_CHK                 = "RESISTANCE CHECK"
IDS_EC_TB_NAME_WELDTHICK_CHK                  = "WELDING THROAT THICKNESS CHECK"

IDS_EC_TB_NAME_DESIGN_METHOD_EAM              = "Equivalent T-stub Method"
IDS_EC_TB_NAME_DESIGN_METHOD_FEM              = "Finite Element Method"
IDC_EC_TB_NAME_WELD_CHECK                     = "Weld Check"